.appsec-tests/CVE-2023-20198/CVE-2023-20198.yaml

id: CVE-2023-20198
info:
  name: CVE-2023-20198
  author: crowdsec
  severity: info
  description: CVE-2023-20198 testing
  tags: appsec-testing
http:
  - raw:
    - |
      POST /%2577ebui_wsma_https HTTP/1.1
      Host: {{Hostname}}

      <?xml version="1.0"?>
      <SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <SOAP:Header>
          <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/04/secext">
            <wsse:UsernameToken SOAP:mustUnderstand="false">
              <wsse:Username>#{username}</wsse:Username>
              <wsse:Password>*****</wsse:Password>
            </wsse:UsernameToken>
          </wsse:Security>
        </SOAP:Header>
        <SOAP:Body>
          <request correlator="xxx" xmlns="urn:cisco:wsma-config">
            <configApply details="all" action-on-fail="continue">
              <config-data>
              <cli-config-data-block><![xxx]]></cli-config-data-block>
              </config-data>
            </configApply>
          </request>
        </SOAP:Body>
      </SOAP:Envelope>
    cookie-reuse: true
#test will fail because we won't match http status 
    matchers:
    - type: status
      status:
       - 403
